[
    {
        "image": "RX-78-2 Gundam.png", 
        "modelCode": "RX-78-2", 
        "name": "Gundam",
        "series": "Mobile Suit Gundam",
        "description": "One of the prototype main Mobile Suits developed by the Earth Federation Forces based on the V Project. This unit can be called an 'all-purpose type,' incorporating most of the concepts proposed in the RX Plan. It adopts the Core Block System, which maintains compatibility with the early RX series' Guncannon and Guntank."
    },
    {
        "image": "RX-77-2 Guncannon.png", 
        "modelCode": "RX-77-2", 
        "name": "Guncannon",
        "series": "Mobile Suit Gundam",
        "description": "A prototype artillery Mobile Suit designed primarily for mid-range fire support. Rolled out around the same time as the Gundam and Guntank, this unit also utilizes the Core Block System. Its design prioritizes ballistic resistance over mobility, eliminating the need for a shield."
    },
    {
        "image": "RX-75-4 Guntank.png", 
        "modelCode": "RX-75-4", 
        "name": "Guntank",
        "series": "Mobile Suit Gundam",
        "description": "A prototype artillery Mobile Suit designed primarily for long-range fire support. Rolled out around the same time as the Gundam and Guncannon, this unit also employs the Core Block System. It was partly developed as a contingency in case the development of MS bipedal locomotion or beam rifles encountered difficulties. While capable of combat in space, its mobility is severely limited."
    },
    {
        "image": "RX-78-2 Gundam + B-Parts.png", 
        "modelCode": "RX-78-2", 
        "name": "Gundam + B-Parts",
        "series": "Mobile Suit Gundam",
        "description": "Enhanced variant of the RX-78-2 Gundam equipped with additional B-Parts enhancement equipment for improved combat capabilities."
    },
    {
        "image": "MS-06F Zaku II.png", 
        "modelCode": "MS-06F", 
        "name": "Zaku II",
        "series": "Mobile Suit Gundam",
        "description": "A variant of the Zaku II C-type with nuclear protection equipment removed to improve operational efficiency. Boasting exceptional versatility, this model served as the Principality of Zeon's mainstay mobile suit throughout the One Year War."
    },
    {
        "image": "MS-06S Zaku II (Char Aznable).png", 
        "modelCode": "MS-06S", 
        "name": "Zaku II (Char Aznable)",
        "series": "Mobile Suit Gundam",
        "description": "This MS-06S Zaku II Commander Type was personally customized for Major Char Aznable. By effectively utilizing its thrusters and other systems, it demonstrated mobility said to be 'three times faster than normal.' During the Battle of Loum, it achieved the remarkable feat of sinking five enemy warships. Combined with its distinctive red color scheme, these accomplishments earned it the nickname 'Red Comet.' This title not only reflects the superior performance of the Zaku IIS but also highlights then-Lieutenant Char's exceptional piloting skills."
    },
    {
        "image": "MS-05B Zaku I.png", 
        "modelCode": "MS-05B", 
        "name": "Zaku I",
        "series": "Mobile Suit Gundam",
        "description": "The first mass-produced combat Mobile Suit developed by the Principality of Zeon. Early production models were designated as MS-05A before specifications were upgraded to the MS-05B variant. The operational data gathered from these units directly contributed to the development decision for the MS-06 series."
    },
    {
        "image": "MS-07B Gouf.png", 
        "modelCode": "MS-07B", 
        "name": "Gouf",
        "series": "Mobile Suit Gundam",
        "description": "Developed as a ground combat Mobile Suit for gravity environments. Originally conceived as an enhanced version of the MS-06J type, it ultimately evolved into a completely distinct model. Based on combat simulations focusing on MS melee engagements, the Type B variant - equipped with standardized armaments - was selected for mass production."
    },
    {
        "image": "MS-09 Dom.png", 
        "modelCode": "MS-09", 
        "name": "Dom",
        "series": "Mobile Suit Gundam",
        "description": "The mass-production model of the Dom series. This unit demonstrates exceptional ground combat capabilities through its heavy firepower, ballistic-resistant heavy armor, and unmatched ground speed via thermonuclear hover systems. With a maximum ground speed of 381 km/h and superior offensive/defensive capabilities, it proved ideal for hit-and-run tactics."
    },
    {
        "image": "YMS-15 Gyan.png", 
        "modelCode": "YMS-15", 
        "name": "Gyan",
        "series": "Mobile Suit Gundam",
        "description": "A specialized close-combat Mobile Suit developed by Zimmad Company under the Next-Generation Mainstay MS Development Program. Despite its unique design philosophy focusing on melee combat, it ultimately lost out to the Gelgoog in the final selection process."
    },
    {
        "image": "MAX-03 Adzam.png", 
        "modelCode": "MAX-03", 
        "name": "Adzam",
        "series": "Mobile Suit Gundam",
        "description": "A prototype Mobile Armor modified from the G87 Luna Tank lunar transport pod. Serving as a testbed for Minovsky Craft system technology, it also incorporates hover engines. When synchronized with the Apsalus Leader unit, this weapon can trap enemy units in a high-frequency electromagnetic cage, then attack them with electromagnetic waves and 4000°C extreme heat."
    },
    {
        "image": "MSM-07S Z'Gok (Char Aznable).png", 
        "modelCode": "MSM-07S", 
        "name": "Z'Gok (Char Aznable)",
        "series": "Mobile Suit Gundam",
        "description": "This Z'Gok was piloted by Char Aznable upon his assignment to the Mad Angler squadron. A late-model personal custom unit, it demonstrated a 20% performance improvement over the standard variant."
    },
	{
        "image": "RGM-79 GM.png", 
        "modelCode": "RGM-79", 
        "name": "GM",
        "series": "Mobile Suit Gundam",
        "description": "The Earth Federation Forces' primary mass-production mobile suit. Developed based on data from prototype units like the Gundam, this MS balances production efficiency with performance as a mainstay combat unit. While omitting the Core Block System, some variants feature modularized power and control systems built to equivalent specifications."
    },
	{
        "image": "MSM-03 Gogg.png", 
        "modelCode": "MSM-03", 
        "name": "Gogg",
        "series": "Mobile Suit Gundam",
        "description": "An amphibious mobile suit developed by the Zeon Principality. It was the first water/land combat MS to achieve mass production success. By retracting its limbs into the body to reduce drag, it can assume a hydrodynamically optimized form capable of reaching underwater speeds up to 70 knots."
    },
	{
        "image": "MSM-04 Acguy.png", 
        "modelCode": "MSM-04", 
        "name": "Acguy",
        "series": "Mobile Suit Gundam",
        "description": "An amphibious mobile suit developed by the Principality of Zeon, renowned for its high stealth capabilities. While its standard configuration features a retractable right arm with built-in mega particle cannon (Iron Nail) and a left arm with 6-tube missile launcher, the modular arm units allow for alternative weapon configurations."
    },
	{
        "image": "MSM-07 Z'Gok.png", 
        "modelCode": "MSM-07", 
        "name": "Z'Gok",
        "series": "Mobile Suit Gundam",
        "description": "An amphibious mobile suit developed by the Principality of Zeon. Among MS in its class, it boasts superior ground combat capabilities, enabling it to fight Federation mass-production models on equal or better terms. Each of its claw-equipped arms contains a built-in mega particle cannon at the center."
    },
	{
        "image": "MSM-10 Zock.png", 
        "modelCode": "MSM-10", 
        "name": "Zock",
        "series": "Mobile Suit Gundam",
        "description": "An amphibious mobile weapon developed by the Principality of Zeon. Unlike conventional MS, this unit cannot walk on land and instead moves via hopping locomotion, functioning more like an artillery platform than a standard mobile suit. With its unprecedented symmetrical front/rear design, it exhibits characteristics closer to a Mobile Armor (MA) than a typical MS."
    },
	{
        "image": "MAM-07 Grublo.png", 
        "modelCode": "MAM-07", 
        "name": "Grublo",
        "series": "Mobile Suit Gundam",
        "description": "A submersible Mobile Armor developed by the Principality of Zeon for underwater combat. With operational range comparable to nuclear submarines and side-mounted auxiliary thrusters that double as functional arm units, it demonstrates underwater mobility far surpassing conventional submarines."
    },
	{
        "image": "MA-04X Zakrello.png", 
        "modelCode": "MA-04X", 
        "name": "Zakrello",
        "series": "Mobile Suit Gundam",
        "description": "An experimental Mobile Armor abandoned mid-development by Zeon forces. This unit possessed a grotesque design featuring a face-like torso and twin scythe arms. During its solo assault on White Base, its predictable movement patterns were exploited, resulting in its destruction."
    },
	{
        "image": "MA-05 Bigro.png", 
        "modelCode": "MA-05", 
        "name": "Bigro",
        "series": "Mobile Suit Gundam",
        "description": "A space combat Mobile Armor developed by the Principality of Zeon. With exceptional acceleration and maneuverability, it executes advanced spatial tactics including hit-and-run strikes with its mega particle cannon, as well as slashing attacks and mid-flight captures during close encounters. Some records indicate multiple units were produced."
    },
	{
        "image": "MS-14 Gelgoog.png", 
        "modelCode": "MS-14", 
        "name": "Gelgoog",
        "series": "Mobile Suit Gundam",
        "description": "Developed as the successor to the Zaku II, this next-generation Mobile Suit became the Principality of Zeon’s new frontline unit. It was the first Zeon MS to standardize beam rifle armament."
    },
	{
        "image": "MS-14S Gelgoog (Char Aznable).png", 
        "modelCode": "MS-14S", 
        "name": "Gelgoog (Char Aznable)",
        "series": "Mobile Suit Gundam",
        "description": "One of only 25 MS-14S/YMS-14 units produced, this machine was piloted by Colonel Char Aznable. Painted in his signature red, it engaged the Gundam in combat at the Texas Colony. During their rematch after the Solomon offensive, the unit’s right arm was destroyed. Unconfirmed reports suggest it was later refitted for deep space operations."
    },
	{
		"image": "MAN-18 Elmeth.png",
		"modelCode": "MAN-18",
		"name": "Elmeth",
		"series": "Mobile Suit Gundam",
		"description": "A Newtype-use Mobile Armor developed by the Principality of Zeon. Equipped with a Psycommu system, it can perform all-range attacks using wire-guided mega particle cannon bits. Enemy units are often destroyed without even noticing the bits' presence. The main unit's mobility is also exceptionally high, armed with two mega particle cannons."
	},
	{
		"image": "MS-09R Rick Dom.png",
		"modelCode": "MS-09R",
		"name": "Rick Dom",
		"series": "Mobile Suit Gundam",
		"description": "A Zeon space-use heavy Mobile Suit. This unit was converted for space combat by refitting the engines from the ground combat MS-09 Dom. After deployment, it replaced the Zaku as the main space combat MS and played an active role. Its main armament is a 360mm rocket bazooka."
	},
	{
		"image": "MAN-03 Braw-Bro.png",
		"modelCode": "MAN-03",
		"name": "Braw-Bro",
		"series": "Mobile Suit Gundam",
		"description": "A Newtype-use Mobile Armor developed by the Principality of Zeon. Equipped with a special control system called Psycommu, it handles both unit control and weapon fire control. This enables complex remote attacks known as all-range attacks."
	},
	{
		"image": "MA-08 Big-Zam.png",
		"modelCode": "MA-08",
		"name": "Big-Zam",
		"series": "Mobile Suit Gundam",
		"description": "A Mobile Armor developed by the Principality of Zeon for fortress assaults, with plans for mass production. Capable of deploying a beam barrier via its I-field generator, making it virtually invulnerable against mid-to-long range beam attacks. However, it has limited defensive capability against beam or projectile weapons fired from inside its I-field range."
	},
	{
		"image": "RB-79 Ball.png",
		"modelCode": "RB-79",
		"name": "Ball",
		"series": "Mobile Suit Gundam",
		"description": "A simplified Mobile Suit developed by the Earth Federation as support for the RGM-79 GM. More akin to an armed work pod than a true Mobile Suit. Developed and mass-produced at Luna II base, it saw action in battles such as Solomon and A Baoa Qu."
	},
	{
		"image": "MSN-02 Zeong.png",
		"modelCode": "MSN-02",
		"name": "Zeong",
		"series": "Mobile Suit Gundam",
		"description": "A Newtype-use Mobile Suit bearing the name of Zeon itself, representing the Principality's pride. Armed with 13 mega particle cannons in its head, abdomen, and fingertips, it performs all-range attacks using both its detached forearms and main body. Though legs were developed for this unit, some sources suggest they weren't completed in time for deployment."
	},
	{
        "image": "MS-06R-2S Zaku Late Production Type (Dozle Zabi).png", 
        "modelCode": "MS-06R-2S", 
        "name": "Zaku Late Production Type (Dozle Zabi)",
        "series": "Fukuchi Mobile Station",
        "description": "A next-generation unit intended for Dozle Zabi’s personal use to annihilate the Federation fleet and strike Jaburo with decisive force. Painted in black. However, the unexpectedly early launch of Operation Star One led to Solomon’s fall before its deployment. With Dozle instead piloting the Big Zam dispatched from A Baoa Qu, only this machine’s technical data was transferred to the Gwazine."
    },
	{
        "image": "MS-06J Zaku II (Ken Bederstadt).png", 
        "modelCode": "MS-06J", 
        "name": "Zaku II Ground Type (Ken Bederstadt)",
        "series": "Mobile Suit Gundam: Lost War Chronicles",
        "description": "The mobile suit of Zeon's Foreign Legion, piloted by Lieutenant Commander Ken Bederstadt. As non-Zeon nationals, these soldiers were treated as expendable assets, forcibly deployed as a special guerrilla unit across global hotspots for high-risk missions."
    },
	{
		"image": "RGM-79NA Atomic Heavy Armor GM Custom.png",
		"modelCode": "RGM-79NA",
		"name": "Atomic Heavy Armor GM Custom",
		"series": "Mobile Suit Gundam 0083: Rebellion",
		"description": "A concept Mobile Suit developed early on for the purpose of operating the Atomic Bazooka, based on the GM Custom which was developed post-One Year War as a high-output machine for ace pilots. It features an unusual configuration with its right arm replaced by the Atomic Bazooka itself. To protect the cockpit from fusion reaction shock, chest armor is reinforced and additional frontal armor is equipped across the entire body."
	},
	{
		"image": "NRX-044 Asshimar (Glemy Faction Specification).png",
		"modelCode": "NRX-044",
		"name": "Asshimar (Glemy Faction Specification)",
		"series": "Mobile Suit ZZ Gundam",
		"description": "A machine of the Glemy Faction that was taken over by Neo Zeon. It accompanies the Quin Mantha and other Titans or Neo Zeon mobile suits. Although originally designed for atmospheric use, this unit appears in space."
	},
	{
		"image": "MSZ-008V ZⅡ V-Type.png",
		"modelCode": "MSZ-008V",
		"name": "ZⅡ V-Type",
		"series": "Mobile Suit Gundam Valpurgis",
		"description": "The ZⅡ's development was shelved during the First Neo Zeon War due to the ZZ Gundam being prioritized. However, based on combat data gathered when completed prototypes were deployed in the Axis offensive, limited production was approved and several improved variants were developed. The V-Type is one of these machines, enhanced for close-quarters combat capabilities optimized for Mobile Suit engagements."
	},
	{
		"image": "EMS-12 Arana.png",
		"modelCode": "EMS-12",
		"name": "Arana",
		"series": "Mobile Suit Crossbone Gundam Skull Heart",
		"description": "A Jupiter Empire next-generation main force mass production plan machine, classified as a small Mobile Suit at approximately 10 meters tall. Although it was not completed during the Jupiter War, its S-size frame technology was utilized in the development of the Abijo and Angel Halo."
	},
	{
		"image": "MS-07 Gouf (Origin).png",
		"modelCode": "MS-07",
		"name": "Gouf (Origin)",
		"series": "Mobile Suit Gundam: The Origin",
		"description": "A ground combat Mobile Suit of the Zeon military with a different operational concept than the Zaku, specializing in close combat with weapons like the heat rod and heat sword. This unit was piloted by Captain Ramba Ral, 'The Blue Giant', who was tasked with destroying the White Base."
}	,
	{
        "image": "GF13-017NJ Shining Gundam.png", 
        "modelCode": "GF13-017NJ", 
        "name": "Shining Gundam",
        "series": "Mobile Fighter G Gundam",
        "description": "Neo Japan's Mobile Fighter. Its Emotion Energy System fluctuates combat power based on the pilot's emotional state. The signature Shining Finger technique coats its fist in luminous liquid metal, capable of atomizing anything it grasps with radiant fury."
    },
	{
        "image": "XXXG-01W Wing Gundam.png", 
        "modelCode": "XXXG-01W", 
        "name": "Wing Gundam",
        "series": "New Mobile Report Gundam Wing",
        "description": "A transformable Mobile Suit developed by Doctor J, This Gundam variant stands out among Earth-deployed units with exceptional versatility, featuring a devastating Buster Rifle and high-speed Bird Mode transformation. Its shield houses a built-in beam saber, while additional armaments like head vulcans and shoulder machine cannons ensure close-quarters combat readiness."
    },
	{
		"image": "WMS-01 Aquila.png",
		"modelCode": "WMS-01",
		"name": "Aquila",
		"series": "New Mobile Report Gundam Wing: Frozen Teardrop",
		"description": "The prototype machine that would become the Maganac, designed by Doctor S and Professor H. Approximately 150 units were built around A.C. 190 and operated by the Barton Foundation."
	},
	{
		"image": "SVMS-01AW Union Flag Orbit Package Astro Work Type.png",
		"modelCode": "SVMS-01AW",
		"name": "Union Flag Orbit Package Astro Work Type",
		"series": "Mobile Suit Gundam 00V",
		"description": "A work specification variant of the space-use Flag. Both arms have been replaced with work manipulators, and the arm units can be swapped out depending on the specific task requirements."
	},
	{
		"image": "VMS-15 Union Realdo (Japan Products).png",
		"modelCode": "VMS-15",
		"name": "Union Realdo (Japan Products)",
		"series": "Mobile Suit Gundam 00N",
		"description": "Among the many variant machines of the Union Realdo, this is a locally produced model born from a licensing agreement with Japan. It features revised basic performance through redesign of various components, with nearly all of its parts being manufactured in Japan."
	},
	{
        "image": "Ryomen Sukuna.png", 
        "modelCode": "", 
        "name": "Ryomen Sukuna",
        "series": "Mobile History Gundam Burai",
        "description": "The Iron Cavalry unit piloted by Saishū Shura of Tokugou's 'Four Heavenly Kings' - the elite guard under the direct command of Conquest General Tokugou Souzen. True to its name, this heteromorphic machine bears distinct faces and armaments on both its frontal and dorsal surfaces, embodying its dual-natured design."
    },
	{
		"image": "GF13-050NSW Nobel Gundam GPB-D Color Cardinal.png",
		"modelCode": "GF13-050NSW",
		"name": "Nobel Gundam GPB-D Color \"Cardinal\"",
		"series": "Model Suit Gunpla Builders Beginning D",
		"description": "A Berserker Mode Nobel Gundam secretly built by Saki to fight Rai and Shingo. While primarily colored in Saki's signature red, it features gothic lolita-style frill patterns that showcase her fashionable taste. The dramatically enhanced weaponry also represents Saki's characteristic charm."
	},
	{
		"image": "Beargguy II.png",
		"modelCode": "",
		"name": "Beargguy II",
		"series": "Gundam Build Fighters Try",
		"description": "An evolution of the Beargguy that appears in 'Model Suit Gunpla Builders Beginning G'. Kousaka China, built her 'Beargguy-san' based on this unit. The machine features a lighter brown color for a more bear-like appearance. While it lacks the ribbon strobe light that China added herself, several ribbon-equipped variations of this machine exist."
	},
	{
		"image": "Musha Gundam the 78th.png",
		"modelCode": "",
		"name": "Musha Gundam the 78th",
		"series": "SD Gundam World Heroes: Kirahagane Monogatari",
		"description": "He is the 78th heir to a prestigious family that thrives in the Musha World. He is a skilled sword fighter, but has no interest in power or polltics and rarely engages in warfare. His honest and simple-minded personality often leads to eccentric actions. Having spent his childhood in the countryside, he lives a laid-back life. He was entrusted with Kirahagane due to his skills and peace-loving nature."
	},
	{
        "image": "MS-07B Gouf (Thomas Kurtz).png", 
        "modelCode": "MS-07B", 
        "name": "Gouf (Thomas Kurtz)",
        "series": "Gihren's Greed",
        "description": "The mobile suit of Thomas Kurtz, a Federation defector to the Principality of Zeon. Deployed with guerrilla unit G-27 on Earth's frontlines, this camouflage-patterned machine achieved repeated combat successes through tactical surprise attacks that exploited enemy vulnerabilities."
    },
	{
        "image": "MS-14S Gelgoog (Ramba Ral).png", 
        "modelCode": "MS-14S", 
        "name": "Gelgoog (Ramba Ral)",
        "series": "Gihren's Greed",
        "description": "Customized as the personal unit of 'Blue Giant' Ramba Ral, this machine incorporated his own proposed enhancements including reinforced durability. Its signature blue color scheme completed the transformation into a commander's elite machine."
    },
	{
		"image": "NZ-333 ϝ Azieru.png",
		"modelCode": "NZ-333",
		"name": "ϝ Azieru",
		"series": "Mobile Suit Gundam: Try Age",
		"description": "A modified version of the α Azieru created by Neo Zeon to eliminate remaining Earth Federation forces and bases on Earth after the successful Axis Drop Operation. It features added legs for ground operation and its arms have been replaced with funnel hands instead of sub-arms. Originally intended to bear the name 'Perfect,' its development was halted due to changing battle conditions, and it was instead assigned the lost Greek letter 'ϝ (Digamma)'."
	},
	{
		"image": "GF13-006NA Gundam Maxter (Jungle Combat Type).png",
		"modelCode": "GF13-006NA",
		"name": "Gundam Maxter (Jungle Combat Type)",
		"series": "NG 1/100 Mobile Fighter G Gundam Model Kits",
		"description": "A Gundam Maxter painted with camouflage for operations primarily in jungle environments. Color scheme variations like this were sometimes applied depending on the intended deployment area."
	},
	{
		"image": "MS-06J Zaku II (Jaburo Operation).png",
		"modelCode": "MS-06J",
		"name": "Zaku II (Jaburo Operation)",
		"series": "Great Mechanics - Zaku",
		"description": "A unit deployed in infiltration operations in surrounding areas during the preliminary stages of the Jaburo invasion. This early production J-type model features space-use colors on its movable and power sections, significantly reducing its camouflage effectiveness. In some cases, these prominently painted early production models may have been prioritized as camouflage units."
	},
    {
        "image": "RX-78-2 Gundam (Rollout Model).png", 
        "modelCode": "RX-78-2", 
        "name": "Gundam (Rollout Model)",
        "series": "Master Archive Mobile Suit",
        "description": "Unit 2 was produced after the RX-78-1 specifications were finalized at Jaburo. While ground operational testing had been partially completed, Units 1 through 3 were subsequently transported to Luna II. The transport route to Luna II and the vessels used for delivery remain unconfirmed."
    },
    {
        "image": "RX-78-2 Gundam (Luna II Spec).png", 
        "modelCode": "RX-78-2", 
        "name": "Gundam (Luna II Spec)",
        "series": "Master Archive Mobile Suit",
        "description": "At Luna II, Units 1 through 3 underwent modifications from the RX-78-1 to RX-78-2 specifications. However, while their external appearances matched the new standard, it remains unclear whether every internal component was uniformly updated. For easier identification, each unit received distinct color schemes—Unit 2's tricolor pattern has led some analysts to speculate it was originally prepared for an upcoming ceremonial presentation."
    },
    {
        "image": "RX-78-2 Gundam (Jaburo Spec).png", 
        "modelCode": "RX-78-2", 
        "name": "Gundam (Jaburo Spec)",
        "series": "Master Archive Mobile Suit",
        "description": "At Jaburo, the units received upgrades to their space-use equipment and control systems. While exhibiting minimal external changes, these modifications incorporated new technologies derived from both the limited Federation MS deployments outside the White Base team and parallel mobile suit development programs—suggesting coordinated technological integration between these projects."
    },
    {
        "image": "RX-78-2 Gundam (Konpeitoh Spec).png", 
        "modelCode": "RX-78-2", 
        "name": "Gundam (Konpeitoh Spec)",
        "series": "Master Archive Mobile Suit",
        "description": "Unit 2 underwent its final modifications at the newly captured Konpeitoh (formerly Solomon). In addition to the application of magnetic coating, significant external changes were made to various sections of the mobile suit. Effectively, it was upgraded to specifications equivalent to the RX-78-3."
    }
]